MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048EFM124/mcu.h
#define _SBT13ELOG1_CMD_POSITION                 0x00000000
#define _SBT13ELOG1_CMD_MASK                     0x00000007
#define _SBT13ELOG1_CMD_LENGTH                   0x00000003

#define _SBT13ELOG1_REGION_POSITION              0x00000004
#define _SBT13ELOG1_REGION_MASK                  0x000000F0
#define _SBT13ELOG1_REGION_LENGTH                0x00000004

#define _SBT13ELOG1_INITID_POSITION              0x00000008
#define _SBT13ELOG1_INITID_MASK                  0x0000FF00
#define _SBT13ELOG1_INITID_LENGTH                0x00000008

#define _SBT13ELOG1_CODE_POSITION                0x00000018
#define _SBT13ELOG1_CODE_MASK                    0x0F000000
#define _SBT13ELOG1_CODE_LENGTH                  0x00000004

#define _SBT13ELOG1_MULTI_POSITION               0x0000001F
#define _SBT13ELOG1_MULTI_MASK                   0x80000000
#define _SBT13ELOG1_MULTI_LENGTH                 0x00000001

#define _SBT13ELOG2_GROUP_POSITION               0x00000000
#define _SBT13ELOG2_GROUP_MASK                   0x00000003
#define _SBT13ELOG2_GROUP_LENGTH                 0x00000002

#define _SBT13ECON_ERRP_POSITION                 0x00000018
#define _SBT13ECON_ERRP_MASK                     0x01000000
#define _SBT13ECON_ERRP_LENGTH                   0x00000001

#define _SBT13ECLRS_CLEAR_POSITION               0x00000000
#define _SBT13ECLRS_CLEAR_MASK                   0x00000001
#define _SBT13ECLRS_CLEAR_LENGTH                 0x00000001

#define _SBT13ECLRM_CLEAR_POSITION               0x00000000
#define _SBT13ECLRM_CLEAR_MASK                   0x00000001
#define _SBT13ECLRM_CLEAR_LENGTH                 0x00000001

#define _SBT13REG0_SIZE_POSITION                 0x00000003
#define _SBT13REG0_SIZE_MASK                     0x000000F8
#define _SBT13REG0_SIZE_LENGTH                   0x00000005

#define _SBT13REG0_PRI_POSITION                  0x00000009
#define _SBT13REG0_PRI_MASK                      0x00000200
#define _SBT13REG0_PRI_LENGTH                    0x00000001

#define _SBT13REG0_BASE_POSITION                 0x0000000A
#define _SBT13REG0_BASE_MASK                     0xFFFFFC00
#define _SBT13REG0_BASE_LENGTH                   0x00000016

#define _SBT13RD0_GROUP0_POSITION                0x00000000
#define _SBT13RD0_GROUP0_MASK                    0x00000001
#define _SBT13RD0_GROUP0_LENGTH                  0x00000001

#define _SBT13RD0_GROUP1_POSITION                0x00000001
#define _SBT13RD0_GROUP1_MASK                    0x00000002
#define _SBT13RD0_GROUP1_LENGTH                  0x00000001

#define _SBT13RD0_GROUP2_POSITION                0x00000002
#define _SBT13RD0_GROUP2_MASK                    0x00000004
#define _SBT13RD0_GROUP2_LENGTH                  0x00000001

#define _SBT13RD0_GROUP3_POSITION                0x00000003
#define _SBT13RD0_GROUP3_MASK                    0x00000008
#define _SBT13RD0_GROUP3_LENGTH                  0x00000001

#define _SBT13WR0_GROUP0_POSITION                0x00000000
#define _SBT13WR0_GROUP0_MASK                    0x00000001
#define _SBT13WR0_GROUP0_LENGTH                  0x00000001

#define _SBT13WR0_GROUP1_POSITION                0x00000001
#define _SBT13WR0_GROUP1_MASK                    0x00000002
#define _SBT13WR0_GROUP1_LENGTH                  0x00000001

#define _SBT13WR0_GROUP2_POSITION                0x00000002
#define _SBT13WR0_GROUP2_MASK                    0x00000004
#define _SBT13WR0_GROUP2_LENGTH                  0x00000001

#define _SBT13WR0_GROUP3_POSITION                0x00000003
#define _SBT13WR0_GROUP3_MASK                    0x00000008
#define _SBT13WR0_GROUP3_LENGTH                  0x00000001

#define _USBIE0CSR0_TXMAXP_POSITION              0x00000000
#define _USBIE0CSR0_TXMAXP_MASK                  0x000007FF
#define _USBIE0CSR0_TXMAXP_LENGTH                0x0000000B

#define _USBIE0CSR0_RXRDY_POSITION               0x00000010
#define _USBIE0CSR0_RXRDY_MASK                   0x00010000
#define _USBIE0CSR0_RXRDY_LENGTH                 0x00000001

#define _USBIE0CSR0_TXRDY_POSITION               0x00000011
#define _USBIE0CSR0_TXRDY_MASK                   0x00020000
#define _USBIE0CSR0_TXRDY_LENGTH                 0x00000001

#define _USBIE0CSR0_STALLED_POSITION             0x00000012
#define _USBIE0CSR0_STALLED_MASK                 0x00040000
#define _USBIE0CSR0_STALLED_LENGTH               0x00000001

#define _USBIE0CSR0_SETUP_POSITION               0x00000013
#define _USBIE0CSR0_SETUP_MASK                   0x00080000
#define _USBIE0CSR0_SETUP_LENGTH                 0x00000001

#define _USBIE0CSR0_ERROR_POSITION               0x00000014
#define _USBIE0CSR0_ERROR_MASK                   0x00100000
#define _USBIE0CSR0_ERROR_LENGTH                 0x00000001

#define _USBIE0CSR0_REQPKT_POSITION              0x00000015
#define _USBIE0CSR0_REQPKT_MASK                  0x00200000
#define _USBIE0CSR0_REQPKT_LENGTH                0x00000001

#define _USBIE0CSR0_STATUS_POSITION              0x00000016
#define _USBIE0CSR0_STATUS_MASK                  0x00400000
#define _USBIE0CSR0_STATUS_LENGTH                0x00000001

#define _USBIE0CSR0_NAKTO_POSITION               0x00000017
#define _USBIE0CSR0_NAKTO_MASK                   0x00800000
#define _USBIE0CSR0_NAKTO_LENGTH                 0x00000001

#define _USBIE0CSR0_FLUSH_POSITION               0x00000018
#define _USBIE0CSR0_FLUSH_MASK                   0x01000000
#define _USBIE0CSR0_FLUSH_LENGTH                 0x00000001

#define _USBIE0CSR0_DT_POSITION                  0x00000019
#define _USBIE0CSR0_DT_MASK                      0x02000000
#define _USBIE0CSR0_DT_LENGTH                    0x00000001

#define _USBIE0CSR0_DTWE_POSITION                0x0000001A
#define _USBIE0CSR0_DTWE_MASK                    0x04000000
#define _USBIE0CSR0_DTWE_LENGTH                  0x00000001

#define _USBIE0CSR0_DATAEND_POSITION             0x00000013
#define _USBIE0CSR0_DATAEND_MASK                 0x00080000
#define _USBIE0CSR0_DATAEND_LENGTH               0x00000001

#define _USBIE0CSR0_SETEND_POSITION              0x00000014
#define _USBIE0CSR0_SETEND_MASK                  0x00100000
#define _USBIE0CSR0_SETEND_LENGTH                0x00000001

#define _USBIE0CSR0_STALL_POSITION               0x00000015
#define _USBIE0CSR0_STALL_MASK                   0x00200000
#define _USBIE0CSR0_STALL_LENGTH                 0x00000001

#define _USBIE0CSR0_RXRDYC_POSITION              0x00000016
#define _USBIE0CSR0_RXRDYC_MASK                  0x00400000
#define _USBIE0CSR0_RXRDYC_LENGTH                0x00000001

